// @/services/fund-YouTube-data.ts
import { IOurVideos } from '@/models/interfaces';


/* ------- ВІДЕО YouTube ЗАПИТИ ------- */

/* ----- запити на автомобілі та автотовари ----- */
export const requestsForCarsVideos:IOurVideos[] = [
  {
    id: 1101,
    title: 'Запит від 3 ОШБр на 2 багі та ремонту двох авто',
    url: 'VVrStas3XyU',
  },
  {
    id: 1102,
    title: 'Запит від 3 ОШБр на збір коштів та придбання автомобіля',
    url: 'wfdrIw6KHmw',
  },
  {
    id: 1103,
    title: 'Запит від 61 ОМБр в зборі коштів та придбанні позашляховика',
    url: '47juPwaMJoQ',
  },
  {
    id: 1104,
    title: 'Від 71 ОЄБр на збір коштів та придбання квадроциклу та причепу',
    url: 'im3G2BVRBWU',
  },
  {
    id: 1105,
    title: 'Запит від 108 ОБрТрО на повнопривідний автомобіль',
    url: 'ZkLOCttZTbo',
  },
  {
    id: 1106,
    title: 'Запит від бійців 35 ОМБр на евакуаційний автомобіль',
    url: 'dfZyCALMmVY',
  },
  {
    id: 1107,
    title: 'Запит від бійців 92 ОШБр в зборі коштів та придбанні автомобіля',
    url: 'vKWEFLB7OW4',
  },
  {
    id: 1108,
    title: 'Запит від бійців 108 ОБрТрО на придбання автомобіля',
    url: '3GlHkKa1jMs',
  },
  {
    id: 1109,
    title: 'Від 112 ОБрТро на придбання позашляховика та 2 дрони Mavac 3 Pro',
    url: 'cH2q3Isajcg',
  },
  {
    id: 1110,
    title: 'Запит від бійців 142 ОПБр на придбання позашляховика',
    url: 'axc2AiJZHsQ',
  },
  {
    id: 1111,
    title: 'Запит від бійців батальйону Київська русь на автомобіль',
    url: 'TefyTZqf98A',
  },
  {
    id: 1112,
    title: 'Від мед групи НГУ на комплект зимової гуму для евакуаційного автомобіля',
    url: 'zhX-igQQDVs',
  },
  {
    id: 1113,
    title: 'Запит від медичної роти 44 ОМБр в придбанні позашляховика',
    url: 'JbmC1z2KgeU',
  },
  {
    id: 1114,
    title: 'Запит від медичної служби 43 ОСБ на позашляховик',
    url: 'Sm4bYznBgAI',
  },
  {
    id: 1115,
    title: 'Від бойових медиків на збір коштів на автомобіль для евакуації побратимів',
    url: '3pFN83F5EJU',
  },
  {
    id: 1116,
    title: 'Від медіків 1 роти Морськкої піхоти на допомогу в ремонті медичного автомобіля',
    url: 'ZhqVYWHqe08',
  },
  {
    id: 1117,
    title: 'Запит від Пацанів Майора на автомобіль та Starlink',
    url: 'HTaHLVJs4Js',
  },
];

/* ----- запити від військових медиків ----- */
export const requestFromMilitaryMedicsVideos:IOurVideos[] = [
  {
    id: 1201,
    title: 'Запит від бійців 17 ОТБр по збору коштів та придбанні робонош',
    url: 'hPkVh0FfdJ4',
  },
  {
    id: 1202,
    title: 'Від головного медика 3-ї роти на робоноші для евакуації поранених з передової',
    url: 'njtJ2y7RkHE',
  },
  {
    id: 1203,
    title: 'Від Окремої Єгерської бригади десантно штурмових військ на медичне обладнання',
    url: 'xp4J2GQRMvk',
  },

];

/* ----- запити на безпілотні літальні апарати ----- */
export const requestForUFOvideos:IOurVideos[] = [
  {
    id: 1301,
    title: 'Запит від бійців 3 ОШБр на придбання дрону Mavic 3T',
    url: 'svKqVylClnY',
  },
  {
    id: 1302,
    title: 'Запит від бійців 4 МБ окремої Президентської бригади на 10 fpv дронів',
    url: '-RUMp8NGMzo',
  },
  {
    id: 1303,
    title: 'Запит від бійців 32 ОМБр на дрони Mavic 3T',
    url: 'V1ED55-gEbY',
  },
  {
    id: 1304,
    title: 'Запит від бійців 54 ОМБр на збір коштів на Mavic, тепловізор та бінокля',
    url: 'sPBwDppw9E0',
  },
  {
    id: 1305,
    title: 'Від 71 ОЄБр на придбання тепловізійних камер, павербанків, Зарядних станцій та Mavic 3',
    url: '4PyS3MOts-s',
  },
  {
    id: 1306,
    title: 'Запит від бійців 112 ОБрТрО про допомогу в збору коштів на дрон Mavic 3 Pro',
    url: 'GKR6Harfx-k',
  },
  {
    id: 1307,
    title: 'Запит від бійців 212 ОБТерО на збір коштів та придбання дрону',
    url: 'HszXJwnSPbY',
  },
  {
    id: 1308,
    title: 'Від бійців добровольчого батальйону Терор на 3D окуляри та засоби звязку',
    url: 'LjUCi0KOgEo',
  },
  {
    id: 1309,
    title: 'Від Бійців Окремої Єгерської дшб на турнікети, кровоспинні та грілки',
    url: 'Yf9MSn-uT00',
  },
  {
    id: 1310,
    title: 'Запит від бійців підрозділу аеророзвідки 32 ОМБр на Mavic 3T',
    url: 'jpXWcbrqJ5I',
  },
  {
    id: 1311,
    title: 'Запит на 2 дрони від групи аеророзвідки 65 ОМБр',
    url: 'XOpgk5vALzc',
  },
  {
    id: 1312,
    title: 'Запит на дрон Mavic 3T від 93 ї ОМБр Холодний Яр',
    url: 'e9JpsXSHtjk',
  },
  {
    id: 1313,
    title: 'Запит на збір коштів на fpv дрони',
    url: '2CjEWza1mRM',
  },

];
/* ----- запити на військове обладнання ----- */
export const requestForMilitaryEquipmentVideos:IOurVideos[] = [
  {
    id: 1401,
    title: 'Запит від 14 ОМБр на збір коштів та придбання Starlink',
    url: 'mAOGTH-H11M',
  },
  {
    id: 1402,
    title: 'Запит від бійців 3 ОШБр на тепловізор',
    url: '9Fvws9EbWtE',
  },
  {
    id: 1403,
    title: 'Запит від бійців 31 ОМБр на придбання генератора',
    url: 'rsnYaLQegWk',
  },
  {
    id: 1404,
    title: 'Запит від бійців 61 гв ТБр  на придбання бензопил, сокир та лопат',
    url: 'tAgDB43-mg8',
  },
  {
    id: 1405,
    title: 'Запит від БОП Гроза НАГ на прилади нічного бачення та тепловізори',
    url: '22tzsiXBbu0',
  },
  {
    id: 1406,
    title: 'Від єгерської бригади на Starlink3шт, EcoFlow2шт, мобільні пристрої 5шт',
    url: 'idGAzePB_Is',
  },
  {
    id: 1407,
    title: 'Запит на закупівлю рацій Motorolla',
    url: 's0FAW9HE1bM',
  },
  {
    id: 1408,
    title: 'На збір коштів для придбання зарядної станції та комплекту гуми до позашляховика',
    url: 'AfWe_riGYqc',
  },
  {
    id: 1409,
    title: 'Запит на пошукові прожектори шахедів',
    url: 'Atcf89do2aU',
  },
  {
    id: 1410,
    title: 'Звернення від наших постійних партнерів з Сполучених штатів Америки',
    url: 'vhlFE9U8UMk',
  },

];

/* ------- ВІДЕО YouTube ЗВІТИ ------- */

/* ----- Звіти про надані фондом автівки ----- */
export const reportOfCarsVideos:IOurVideos[] = [
  {
    id: 2101,
    title: 'Бійці 53 ОМБр про отримання автомобіля для виконання бойових задач',
    url: 'fRPubuwhVvM',
  },
  {
    id: 2102,
    title: 'Бійці 95 ОДШб дякують за ремонт автомобіля',
    url: 'j4HLogv-sKw',
  },
  {
    id: 2103,
    title: 'Бійці батальйону Карпатська Січ звітують про отриманий позашляховик',
    url: 'BdKr1Nhj_jo',
  },
  {
    id: 2104,
    title: 'Бійці ГУР звітують про отриманий позашляховик',
    url: 'Tp377u7jbAE',
  },
  {
    id: 2105,
    title: 'Бійці добровольчого батальйону Свобода про отримання позашляховика',
    url: 'qBXVUPOLM44',
  },
  {
    id: 2106,
    title: 'Бійці з Окремої Єгерської бригади звітують про отримання Багі',
    url: 'xUuA9A1gJxM',
  },
  {
    id: 2107,
    title: 'Бійці роти вогневої підтримки Гвардії наступу Рубіж про отримання автомобіля',
    url: 'DT4i-46EU1c',
  },
  {
    id: 2108,
    title: 'Військовослужбовці звітують про отримання автомобіля',
    url: 'noAesDpl3aE',
  },
  {
    id: 2109,
    title: 'Звіт від 3 ОШБр про отримання позашляховика',
    url: 'bL-7aI6M4Qg',
  },
  {
    id: 2110,
    title: 'Звіт від 5 ОБр про отримання позашляховика Jeep Grand Cherokee',
    url: 'GOa0IIWd-fY',
  },
  {
    id: 2111,
    title: 'Звіт від 58 ОМПБр про відремонтований автомобіль',
    url: 'rLyiKXwzwpw',
  },
  {
    id: 2112,
    title: 'Звіт від бійців 72 ОМБр за отриману гуму',
    url: 'toz4ulWmEAs',
  },
  {
    id: 2113,
    title: 'Від 45 ОСБ про відремонтований автомобіль, тепловізор, зарядну станцію та планшет',
    url: 'brephEvvKZ0',
  },
  {
    id: 2114,
    title: 'Звіт від буйців 4 БрОП НГУ за наданий автомобіль',
    url: 'Lqa8XNCnSB0',
  },
  {
    id: 2115,
    title: 'Звіт від захисників про отримане авто',
    url: 'uSKIS78vy-Y',
  },
  {
    id: 2116,
    title: 'Звіт за 2 отримані автомобілі',
    url: '3oSRMs3LPas',
  },
  {
    id: 2117,
    title: 'Звіт за відремонтований автомобіль',
    url: 'Pxx8OvRSQp4',
  },
  {
    id: 2118,
    title: 'Про допомогу в придбанні комплекту гуми на авто від БФ Янгол ЗСУ',
    url: '_zemTzhQRTg',
  },
  {
    id: 2119,
    title: 'Звіт про отримане авто від бійців 114 БрТА',
    url: 'hrbkl2xW4K0',
  },
  {
    id: 2120,
    title: 'Звіт про отримання авто для медичної роти',
    url: 'I1xkEI0_w5I',
  },
  {
    id: 2121,
    title: 'Звіт про отримання автомобіля',
    url: 'mbsBX1lGApM',
  },
  {
    id: 2122,
    title: 'Про отримання позашляховика та тепловізійного прицілу для снайперської гвинтівки',
    url: 'fS0jAD59oAc',
  },
  {
    id: 2123,
    title: 'Звітує Окрема єгерська бригада за отриманий квадроцикл',
    url: 'sYWOifC0ZbA',
  },
  {
    id: 2124,
    title: 'Бійці 4 БрОП Рубіж за отримання Позашляховика, 2-х EcoFlow, Mavic 3T та прицілу для СГ',
    url: 'ZJw8Yr3nH6o',
  },
  {
    id: 2125,
    title: 'Лінкольн для 5 ОШБр передано',
    url: 'z2jFHYBKZKM',
  },
  {
    id: 2126,
    title: 'Медики з 36 ОБрМП звітують про відремонтований автомобіль',
    url: 'JENw9JkFDbM',
  },
  {
    id: 2127,
    title: 'Передали на Сумській напрямок автомобіль для бригади забезпечення',
    url: 'X1SifY2AfPQ',
  },

];

/* ----- Звіти про надане фондом медичне обладнання ----- */
export const reportOfMedicalInstruments:IOurVideos[] = [
  {
    id: 2201,
    title: 'Звіт від 45 ОСБ на отримані турнікет 50шт',
    url: 'BTmedHxAOJA',
  },
  {
    id: 2202,
    title: 'Звіт від військового за отримані ліки',
    url: '2wXZ_ddOmNY',
  },
  {
    id: 2203,
    title: 'Звіт від медичної групи про отримання тактичних складних ліжок',
    url: 'DsJsOm0DsxA',
  },
  {
    id: 2204,
    title: 'Звітуємо про отримання медицини від постійних партнерів фонду',
    url: 'NkYbi_gOvzg',
  },
  {
    id: 2205,
    title: 'Медики 58 ОМПБр про отримання мед. препаратів та розхідних матеріалів ',
    url: 'H7NixLQ4OdA',
  },
  {
    id: 2206,
    title: 'Звіт від прекрасного медика про отримання дефібрилятора',
    url: 'al4Dl_HuIBw',
  },
  {
    id: 2207,
    title: 'Хлопці з 17 ОТБр звітують про отримання волокуш для евакуації поранених',
    url: 'PB4mz_UND0g',
  },
];

/* ----- Звіти про надані фондом безпілотні літальні апарати ----- */
export const reportOfUFOvideos:IOurVideos[] = [
  {
    id: 2301,
    title: 'Бійці 1 го батальйону взводу розвідки звітують про отримання Mavic 3T',
    url: 'WVZt9vVrryo',
  },
  {
    id: 2302,
    title: 'Звіт від 47 ОМБр Магура про отримання тепловізійного дрону Mavic 3T',
    url: '0-z2y0y7hK8',
  },
  {
    id: 2303,
    title: 'Від 71 ОЄБр про отримання Mavic 3T, Starlink, 2 зарядні станції та бавербанки',
    url: 'KDQK6jDO_G8',
  },
  {
    id: 2304,
    title: 'Звіт від бійців 5 ОШБр про отримання дрону Mavic 3 Pro',
    url: 'w_gBryt19MY',
  },
  {
    id: 2305,
    title: 'Звіт від бійців 45 ОСБ про отримання дронів',
    url: 'PTOC7EOiEac',
  },
  {
    id: 2306,
    title: 'Звіт від бійців 101 ОБрО ГШ про отримання дрону Mavic 3',
    url: 'w_E1Mpo5Ixs',
  },
  {
    id: 2307,
    title: 'Звіт від бійців ОАБр за наданий дрон',
    url: 'hkFb5UcTn-A',
  },
  {
    id: 2308,
    title: 'Звіт від бійців про отримання дрону Mavic 3 Pro',
    url: 'E6svgEBNVYc',
  },
  {
    id: 2309,
    title: 'Звіт від захисника про отримання дрону Mavic',
    url: 'rVdNUG_7ozY',
  },
  {
    id: 2310,
    title: 'Звіт від наших партнерів з США про передачу 20 БПЛА для 45 ОСБ',
    url: 'eG2noUYMdco',
  },
];

/* ----- Звіти про надані фондом корисні речі для військових ----- */
export const reportOfUsefulThingsVideos:IOurVideos[] = [
  {
    id: 2401,
    title: 'Бійці 30 ОМБр звітують про отримання генератора',
    url: '6IkEKpcZy_4',
  },
  {
    id: 2402,
    title: 'Бійці 58-ї бригади звітують про отримання Starlink',
    url: 'WZzz3AUlkT4',
  },
  {
    id: 2403,
    title: 'Бійці 210 ОСб Berlingo звітують про отримання зарядної станції',
    url: 'c7Y2t4etfbo',
  },
  {
    id: 2404,
    title: 'Бійці Чернігівського 161 батальйону звітують про отримання Starlink',
    url: '9X-XJJFbgyE',
  },
  {
    id: 2405,
    title: 'Вдячність від бійців з 61 ОМБр',
    url: '2-rLkEj6Hw0',
  },
  {
    id: 2406,
    title: 'Військові обкатують передане авто',
    url: 'KSjqTs-E3Jw',
  },
  {
    id: 2407,
    title: 'Вітання від наших захисників',
    url: 'u2N9gWIPdX0',
  },
  {
    id: 2408,
    title: 'Воїни 80 ОДШБр, 5 ОШБр та ШБр НГУ Лють про звільнення населеного пункту Кліщії',
    url: 'GqADZY7TpaI',
  },
  {
    id: 2409,
    title: 'Готуємось до виїзду в Ізюм та передачі автомобіля швидкої допомоги',
    url: 'RTtl3JO7LhY',
  },
  {
    id: 2410,
    title: 'Від 4 бригади оперативного призначення Рубіж за надання зарядної станції EcoFlow',
    url: 'Mg_Il35lD1c',
  },
  {
    id: 2411,
    title: 'Звіт від бійців 36 бригади за надання генератора та 2 х планшетів',
    url: 's3FCIdpqSOs',
  },
  {
    id: 2412,
    title: 'Звіт від бійців за наданий тепловізор та термобілизну',
    url: 'wrB1yrtwjKM',
  },
  {
    id: 2413,
    title: 'Звіт від бійця 36 ОБрМП про надання планшету',
    url: '7nnnDKx7b8Y',
  },
  {
    id: 2414,
    title: 'Звіт від бійця за отриманий шолом',
    url: '6pniZWLgWC4',
  },
  {
    id: 2415,
    title: 'Звіт від військових про отримання тепловізора',
    url: '3p5O2UHN2pY',
  },
  {
    id: 2416,
    title: 'Звіт від військового за надану гуманітарну допомогу',
    url: 'qxFXoazg6p8',
  },
  {
    id: 2417,
    title: 'Звіт від військового про',
    url: 'wKL0ClWhHbI',
  },
  {
    id: 2418,
    title: 'Від військовослужбовців про отримання генератора, інструментів',
    url: 'pn9UgAFwyro',
  },
  {
    id: 2419,
    title: 'Звіт від війської про отримання амуніції',
    url: '4wYQ4UTMeqU',
  },
  {
    id: 2420,
    title: 'Звіт від волонтера БФ Янгол ЗСУ перед виїздом на Донецький напрямок',
    url: 'qZal-dyKXmU',
  },
  {
    id: 2421,
    title: 'Від 151 батальйону про отримання Starlink, планшету та тактичних навушників',
    url: 'j10wQq-hcfg',
  },
  {
    id: 2422,
    title: 'Звіт від ГУР про отримання EcoFlow',
    url: '8WBvs3h-6Lo',
  },
  {
    id: 2423,
    title: 'Від жителів Херсонщини про отримання павербанків для населення та військовослужбовці',
    url: 'qm-LeBuXXJY',
  },
  {
    id: 2424,
    title: 'Звіт від захисників про отримання планшетів',
    url: 'nm97xiuGXz4',
  },
  {
    id: 2425,
    title: 'Звіт від захисниці за передану амуніцію',
    url: 'PgUEJmdkSiQ',
  },
  {
    id: 2426,
    title: 'Звіт від медиків за надану зарядну станцію',
    url: '2amB5W8i_Co',
  },
  {
    id: 2427,
    title: 'Звіт від рятівників Херсонщини за надання генератора та мотору до човна',
    url: 'JbL0SFLM3Ys',
  },
  {
    id: 2428,
    title: 'Звіт від хлопців з 406 ОСБ про отримання EcoFlow',
    url: 'IusFwO2aOPQ',
  },
  {
    id: 2429,
    title: 'Звіт за наданий Starlink',
    url: 'YTLMWOGzxxU',
  },
  {
    id: 2430,
    title: 'Звіт за надання тепловізора',
    url: 'CLqpkQrnUXo',
  },
  {
    id: 2431,
    title: 'Звіт за отриманий Starlink',
    url: 'g_FOo1QgDxE',
  },
  {
    id: 2432,
    title: 'Звіт за отримання зарядної станції',
    url: '-BPoDUtvIcc',
  },
  {
    id: 2433,
    title: 'Звіт про отримання Starlink',
    url: 'w46FXkmwS1w',
  },
  {
    id: 2434,
    title: 'Звіт про отримання бронежилету',
    url: 'ks2s29kP5ms',
  },
  {
    id: 2435,
    title: 'Звіт про отримання планшетів',
    url: 'u2vsMONDjcI',
  },
  {
    id: 2436,
    title: 'Звіт про отримання продуктів харчування',
    url: 'FseINag72s0',
  },
  {
    id: 2437,
    title: 'Отримання тепловізора, амуніції, продуктів харчування та енергетичних напоїв',
    url: 'z1v7U_qDSKc',
  },
  {
    id: 2438,
    title: 'Звіт та вдячність від військових за надання тактичного годинника',
    url: 'cW4wFyO-bGE',
  },
  {
    id: 2439,
    title: 'Отримання від партнерів енергетиків Non Stop, які передамо військовим на передову',
    url: '5n-6iMHKA0w',
  },
  {
    id: 2440,
    title: 'Звітують бійці 5 ОБр за отриманий тепловізор',
    url: 'vOnmjoPSq28',
  },
  {
    id: 2441,
    title: 'Команда БПЛА окремої бригади морської піхоти звітує про отримання EcoFlow',
    url: '5XLPtK0h3Zw',
  },
  {
    id: 2442,
    title: 'Подяка з Лиману за Олів"єшку та сальцо',
    url: 'c96hx9tzbKc',
  },
  {
    id: 2443,
    title: 'Про отримання зарядної станції звітують бійці 36 ОБрМП',
    url: 'OLllr4TefIs',
  },
  {
    id: 2444,
    title: 'Хлопці з 35 бригади морської піхоти звітують про отриманий Starlink',
    url: 'CHuBmrYrzkA',
  },
  {
    id: 2445,
    title: 'Хлопці з 71 ОЭБр звітують про отримання зарядної станції',
    url: 'g-HjOGh94qA',
  },
  {
    id: 2446,
    title: 'Хлопці передають привід сусідам від БФ Янгол ЗСУ',
    url: '3QwlJ_1tVLQ',
  },
  {
    id: 2447,
    title: 'Населення Полумарянівка дякують за генератор який забезпечує їх електроенергією',
    url: 'aXAmzbhcHac',
  },
];