// @/app/about/page.tsx

export default function AboutPage() {
  return (
    <>
      <section>
        <h1>Розповідаємо про Price Pulse.</h1>
        {/*  */}
        <p>Даний веб-застосунок має на меті показати вам інформацію про ціни на різні товари в торгівельних мережах України.</p>
        <p>Для кожного товару фіксується найнижча ціна, яку спостерігали в певному супермаркеті під час якоїсь акції.</p>
        <p>Таким чином, перебуваючи в магазині, ви зможете порівняти цінник обраного вами товару із цінами в застосунку.
          Та вирішити, чи є вигідною для вас поточна ціна цього товару.</p>
      </section>
      <section>
        <h2>Як користуватися Price Pulse?</h2>
      </section>
    </>
  );
}
